[
    "Why don't scientists trust atoms? Because they make up everything!",
     "How does a penguin build its house? Igloos it together.",
     "What do you call a bear with no teeth? A gummy bear!",
     "Why did the bicycle fall over? It was two-tired.",
     "I'm reading a book on anti-gravity... it's impossible to put down!",
     "Why did the scarecrow win an award? Because he was outstanding in his field.",
     "What do you call fake spaghetti? An impasta.",
     "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
     "I told my computer I needed a break, and now it won’t stop sending me vacation ads.",
     "What do you get when you cross a snowman and a dog? Frostbite!",
     "Why can't your nose be 12 inches long? Because then it would be a foot.",
     "I’m on a seafood diet… I see food and I eat it!",
     "Why did the tomato blush? Because it saw the salad dressing!",
     "How do you organize a space party? You planet.",
     "Did you hear about the cheese factory that exploded? There was nothing left but de-brie.",
     "Why did the cookie go to the hospital? Because it felt crummy.",
     "Parallel lines have so much in common… it’s a shame they’ll never meet.",
     "Why did the math book look sad? It had too many problems.",
     "Why don't eggs tell jokes? They’d crack each other up.",
     "I made a pencil with two erasers… it was pointless.",
     "Why couldn’t the leopard play hide and seek? Because he was always spotted.",
     "What's orange and sounds like a parrot? A carrot!",
     "What do you call a sleeping bull? A bulldozer.",
     "Why did the banana go to the doctor? It wasn’t peeling well.",
     "What do you call a group of musical whales? An orca-stra.",
     "Why did the computer go to art school? Because it had a lot of bytes of creativity.",
     "What kind of shoes do ninjas wear? Sneakers!",
     "Why did the gym close down? It just didn’t work out.",
     "Did you hear about the guy who invented Lifesavers? He made a mint.",
     "Why are ghosts such bad liars? Because they are too transparent.",
     "Why don't skeletons fight each other? They don’t have the guts.",
     "What do you call a fish with no eyes? Fsh.",
     "Why don’t seagulls fly over the bay? Because then they’d be bagels.",
     "How do cows stay up to date? They read the mooo-spaper.",
     "Why did the musician bring a ladder? To reach the high notes.",
     "How do you make a tissue dance? You put a little boogie in it.",
     "What kind of music do mummies listen to? Wrap music.",
     "Why was the broom late? It swept in!",
     "What did one wall say to the other wall? I'll meet you at the corner.",
     "What did the big flower say to the little flower? Hey bud!"
]